In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4.5, 7.3, 2.6, 1.5], index=["d", "c", "b", "a"])
obj

d    4.5
c    7.3
b    2.6
a    1.5
dtype: float64

## Re-indexing series ##

In [3]:
obj.reindex(["a","b","c","d","e"])

a    1.5
b    2.6
c    7.3
d    4.5
e    NaN
dtype: float64

In [4]:
obj.reindex(["a","b","c","d","e"], fill_value=0)

a    1.5
b    2.6
c    7.3
d    4.5
e    0.0
dtype: float64

In [6]:
obj3 = Series(["red", "green", "blue"], index=[0,2,4])
obj3.reindex(range(6), method="pad")

0      red
1      red
2    green
3    green
4     blue
5     blue
dtype: object

## For DataFrames ##

In [17]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=["a","c","d"], columns=["Leeds", "Manchester", "Sheffield"])
frame

   Leeds  Manchester  Sheffield
a      0           1          2
c      3           4          5
d      6           7          8

In [18]:
frame2 = frame.reindex(["a","b","c","d"])
frame2

   Leeds  Manchester  Sheffield
a    0.0         1.0        2.0
b    NaN         NaN        NaN
c    3.0         4.0        5.0
d    6.0         7.0        8.0

In [19]:
frame.reindex(columns=["Leeds","York","Manchester"])

   Leeds  York  Manchester
a      0   NaN           1
c      3   NaN           4
d      6   NaN           7

In [21]:
frame.reindex(index=["a","b","c","d"], columns=["Leeds","York","Manchester"], method="pad")

   Leeds  York  Manchester
a      0   NaN           1
b      0   NaN           1
c      3   NaN           4
d      6   NaN           7

## Deleting entries ##

In [23]:
obj = Series(np.arange(5), index=["a","b","c","d","e"])
new_obj = obj.drop("c")
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [24]:
obj.drop(["d", "b"])

a    0
c    2
e    4
dtype: int32

In [25]:
frame

   Leeds  Manchester  Sheffield
a      0           1          2
c      3           4          5
d      6           7          8

In [27]:
frame.drop(["a"])

   Leeds  Manchester  Sheffield
c      3           4          5
d      6           7          8

In [28]:
frame.drop("Leeds", axis=1)

   Manchester  Sheffield
a           1          2
c           4          5
d           7          8

In [29]:
frame.drop(["Leeds", "Manchester"], axis=1)

   Sheffield
a          2
c          5
d          8

## Filtering ##

In [30]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [31]:
obj["c"]

2

In [32]:
obj[3]

3

In [33]:
obj[2:4]

c    2
d    3
dtype: int32

In [34]:
obj[["b","a","e"]]

b    1
a    0
e    4
dtype: int32

In [35]:
obj["b":"d"]

b    1
c    2
d    3
dtype: int32

In [36]:
obj["b":"d"] = 5
obj

a    0
b    5
c    5
d    5
e    4
dtype: int32

In [37]:
frame

   Leeds  Manchester  Sheffield
a      0           1          2
c      3           4          5
d      6           7          8

In [38]:
frame["Leeds"]

a    0
c    3
d    6
Name: Leeds, dtype: int32

In [39]:
frame[["Leeds", "Sheffield"]]

   Leeds  Sheffield
a      0          2
c      3          5
d      6          8

In [40]:
frame[:2]

   Leeds  Manchester  Sheffield
a      0           1          2
c      3           4          5

In [42]:
frame[ frame["Leeds"]>=3 ]

   Leeds  Manchester  Sheffield
c      3           4          5
d      6           7          8

In [43]:
frame < 6

   Leeds Manchester Sheffield
a   True       True      True
c   True       True      True
d  False      False     False

In [45]:
frame[ frame<6 ] = 0
frame

   Leeds  Manchester  Sheffield
a      0           0          0
c      0           0          0
d      6           7          8

In [55]:
frame = DataFrame(np.arange(12).reshape((3,4)), columns=["a","b","c","d"], index=["Leeds", "Manchester", "Sheffield"])
frame

            a  b   c   d
Leeds       0  1   2   3
Manchester  4  5   6   7
Sheffield   8  9  10  11

In [56]:
frame.ix["Leeds"]

a    0
b    1
c    2
d    3
Name: Leeds, dtype: int32

In [57]:
frame.ix["Leeds", ["d", "a"]]

d    3
a    0
Name: Leeds, dtype: int32

In [58]:
frame.ix[["Leeds", "Sheffield"], [2,0,1]]

            c  a  b
Leeds       2  0  1
Sheffield  10  8  9

In [59]:
frame.ix[frame.b>=5, :3]

            a  b   c
Manchester  4  5   6
Sheffield   8  9  10